# LockProportions Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ImageInstance..::..LockProportions Property
ImageInstance Class See Also
---
When true the proportion of Width to Height will be maintained
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public bool LockProportions { get; set; }
```

Visual Basic
---
```text
Public Property LockProportions As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool LockProportions {
	bool get ();
	void set (bool value);
}
```

# See Also
ImageInstance Class
Autodesk.Revit.DB Namespace